# Machine Learning On House Price Data to Predict House Price

we are going to perform the modelling on house price dataset ,in this we have multiple parameter who can help us to predict the price of the specific house.

# import the required library

In [3]:
# import numerical python 
import numpy as np

# import the pandas
import pandas as pd

# import the seaborn
import seaborn as sns

# import the matplotlib
import matplotlib.pyplot as plt

# Data Overview

In [14]:
# load the data 
df_house_price=pd.read_csv('house_price1.csv')

In [16]:
# show the first five observations of the data
df_house_price.head()

,price,resid_area,air_qual,room_num,age,distance,teachers,poor_prop,airport,n_hos_beds,n_hot_rooms,waterbody,rainfall,bus_ter,Sold
0,24.0,32.31,0.538,6.575,65.2,4.35,24.7,4.98,YES,5.480,11.1920,River,23,YES,0
1,21.6,37.07,0.469,6.421,78.9,4.99,22.2,9.14,NO,7.332,12.1728,Lake,42,YES,1
2,34.7,37.07,0.469,7.185,61.1,5.03,22.2,4.03,NO,7.394,101.1200,NaN,38,YES,0
3,33.4,32.18,0.458,6.998,45.8,6.21,21.3,2.94,YES,9.268,11.2672,Lake,45,YES,0
4,36.2,32.18,0.458,7.147,54.2,6.16,21.3,5.33,NO,8.824,11.2896,Lake,55,YES,0

In [18]:
# show the last five observation of the data
df_house_price.tail()

,price,resid_area,air_qual,room_num,age,distance,teachers,poor_prop,airport,n_hos_beds,n_hot_rooms,waterbody,rainfall,bus_ter,Sold
501,22.4,41.93,0.573,6.593,69.1,2.64,19.0,9.67,NO,9.348,12.1792,Lake and River,27,YES,1
502,20.6,41.93,0.573,6.120,76.7,2.44,19.0,9.08,YES,6.612,13.1648,Lake and River,20,YES,1
503,23.9,41.93,0.573,6.976,91.0,2.34,19.0,5.64,NO,5.478,12.1912,NaN,31,YES,1
504,22.0,41.93,0.573,6.794,89.3,2.54,19.0,6.48,YES,7.940,15.1760,NaN,47,YES,1
505,19.0,41.93,0.573,6.030,80.8,2.72,19.0,7.88,YES,10.280,10.1520,NaN,45,YES,1

In [20]:
# show the shape of the data 
df_house_price.shape

(506, 15)

In [24]:
# show the basic informations of the data
df_house_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        506 non-null    float64
 1   resid_area   506 non-null    float64
 2   air_qual     506 non-null    float64
 3   room_num     506 non-null    float64
 4   age          506 non-null    float64
 5   distance     506 non-null    float64
 6   teachers     506 non-null    float64
 7   poor_prop    506 non-null    float64
 8   airport      506 non-null    object
 9   n_hos_beds   498 non-null    float64
 10  n_hot_rooms  506 non-null    float64
 11  waterbody    351 non-null    object
 12  rainfall     506 non-null    int64
 13  bus_ter      506 non-null    object
 14  Sold         506 non-null    int64
dtypes: float64(10), int64(2), object(3)
memory usage: 59.4+ KB

# interpretation

-we have 506 observation and 15 attributes
-we have age column which contain the outlier

# Data Pre-Processing

In [27]:
# lets perform the data clearning 
df_house_price.columns

Index(['price', 'resid_area', 'air_qual', 'room_num', 'age', 'distance',
       'teachers', 'poor_prop', 'airport', 'n_hos_beds', 'n_hot_rooms',
       'waterbody', 'rainfall', 'bus_ter', 'Sold'],
      dtype='object')

In [31]:
dictionary={
    'price':'Price',
    'resid_area':'Residential_Area',
    'air_qual':'Air_Quality',
    'room_num':'Room_Number',
    'age':'Age',
    'distance':'Distance',
    'teachers':'Teachers',
    'poor_prop':'Poor_Property',
    'airport':'Airport',
    'n_hos_beds':'N_Hospital_Beds',
    'n_hot_room':'N_Hotel_Room',
    'waterbody':'Waterbody',
    'rainfall':'Rainfall',
    'bus_ter':'Bus_Ter',
    'sold':'Sold',
}

In [38]:
# perform the rename action
df_house_price=df_house_price.rename(columns=dictionary)

In [40]:
# do the authentic check
df_house_price.columns

Index(['Price', 'Residential_Area', 'Air_Quality', 'Room_Number', 'Age',
       'Distance', 'Teachers', 'Poor_Property', 'Airport', 'N_Hospital_Beds',
       'n_hot_rooms', 'Waterbody', 'Rainfall', 'Bus_Ter', 'Sold'],
      dtype='object')

### Null Value Handling

In [45]:
# find the number of missing records
df_house_price.isnull().sum()

Price                 0
Residential_Area      0
Air_Quality           0
Room_Number           0
Age                   0
Distance              0
Teachers              0
Poor_Property         0
Airport               0
N_Hospital_Beds       8
n_hot_rooms           0
Waterbody           155
Rainfall              0
Bus_Ter               0
Sold                  0
dtype: int64

In [47]:
# find the percentage
df_house_price.isnull().sum()/len(df_house_price)*100

Price                0.000000
Residential_Area     0.000000
Air_Quality          0.000000
Room_Number          0.000000
Age                  0.000000
Distance             0.000000
Teachers             0.000000
Poor_Property        0.000000
Airport              0.000000
N_Hospital_Beds      1.581028
n_hot_rooms          0.000000
Waterbody           30.632411
Rainfall             0.000000
Bus_Ter              0.000000
Sold                 0.000000
dtype: float64